/*=========================
	ScoreMain.java
=========================*/
/*
○ 성적 처리 → 데이터베이스 연동(데이터베이스 연결 및 액션 처리)
				ScoreDTO 클래스 활용(속성만 존재하는 클래스 getter / setter 구성)
				ScoreDAO 클래스 활용(데이터베이스 액션 처리)
				ScoreProcess 클래스 활용(단위 기능 구성)
※ 단, 모 ~~~~ 든 작업 객체는 PreparedStatement 를 활용한다.

  실행 예) → JDBC04 참고
  
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 1
 
 7번 학생 성적 입력(이름 국어 영어 수학) : 이시우 50 60 70
 성적 입력이 완료되었습니다.
  
 8번 학생 성적 입력(이름 국어 영어 수학) : 이지연 80 80 80
 성적 입력이 완료되었습니다.
  
 9번 학생 성적 입력(이름 국어 영어 수학) : .
  
  
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 2
  
 전체 인원 : 8명
 번호		이름	국어	영어	수학 	총점 	평균	석차
   1
   2
   3
   4						      ...
   .
   .
   .
   8
    
    
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : -1
 
 프로그램이 종료되었습니다.
*/
package com.test;

import java.util.Scanner;

import com.util.DBConn;

public class ScoreMain
{
	public static void main(String[] args)
	{
		
		ScoreProcess prc = new ScoreProcess();
		
		Scanner sc =new Scanner(System.in);
		
		try
		{
			do
			{
				System.out.println(" ====[ 성적 처리 ]====");
				System.out.println(" 1. 성적 입력");
				System.out.println(" 2. 성적 전체 출력");
				System.out.println(" 3. 이름 검색 출력");
				System.out.println(" 4. 성적 수정");
				System.out.println(" 5. 성적 삭제");
				System.out.println(" =====================");
				System.out.print(" >> 선택(1~5, -1종료) : ");
				int menu = sc.nextInt();
				
				if (menu == -1)
					break;
				
				switch (menu)
				{
					case 1:
						prc.prcInsert();
						break;
					case 2:
						prc.prcSelectAll();
						break;
					case 3:
						prc.prcSearchName();
						break;
					case 4:
						prc.prcUpdate();
						break;
					case 5:
						prc.prcDelete();
						break;
				}
				
			} while (true);
			
			// 각자 연결 해제 했으면... 여기선 사실상 의미 없음~!!!
			System.out.println("프로그램 종료.");
		} catch (Exception e)
		{
			System.out.println(e.toString());
		}
	}
}
/*
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 2
전체 인원 수 : 4
번호   이름   국어   영어   수학   총점   평균   석차

  7   강태무   100   100    100     300   100.0     1 

  8   박서준   100    50     60     210    70.0     2 

  9   이종석    40    50     50     140    46.0     3 

  5   남주혁     5     5      5      15     5.0     4 
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 4
수정할 학생번호를 입력해주세요 : 9

번호   이름   국어   영어   수학   총점   평균   석차
  9   이종석    40    50     50     140    46.0     0 
※ 기존 정보를 유지하시려면 『-』 입력.

기존 이름 : 이종석 
수정할 이름 :-
기존 국어점수 : 40
수정할 국어점수 :-
기존 영어점수 : 50
수정할 영어점수 :-
기존 수학점수 : 50
수정할 수학점수 :100
9번 학생의 정보가 수정되었습니다.
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 2
전체 인원 수 : 4
번호   이름   국어   영어   수학   총점   평균   석차

  7   강태무   100   100    100     300   100.0     1 

  8   박서준   100    50     60     210    70.0     2 

  9   이종석    40    50    100     190    63.0     3 

  5   남주혁     5     5      5      15     5.0     4 
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 5
삭제할 학생번호 입력해주세요 : 9

번호   이름   국어   영어   수학   총점   평균
  9   이종석    40    50    100     190    63.0 
9번 학생 정보를 정말 삭제하시겠습니까? (Y/N) : n
삭제가 취소되었습니다.
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 5
삭제할 학생번호 입력해주세요 : 9

번호   이름   국어   영어   수학   총점   평균
  9   이종석    40    50    100     190    63.0 
9번 학생 정보를 정말 삭제하시겠습니까? (Y/N) : y
9번 학생 정보가 정상적으로 삭제되었습니다.
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : 2
전체 인원 수 : 3
번호   이름   국어   영어   수학   총점   평균   석차

  7   강태무   100   100    100     300   100.0     1 

  8   박서준   100    50     60     210    70.0     2 

  5   남주혁     5     5      5      15     5.0     3 
 ====[ 성적 처리 ]====
 1. 성적 입력
 2. 성적 전체 출력
 3. 이름 검색 출력
 4. 성적 수정
 5. 성적 삭제
 =====================
 >> 선택(1~5, -1종료) : -1
프로그램 종료.

*/
